Studio Diagrams/net8.0/mmd/slndependencydiagramgenerator.mmd
flowchart LR
  slndependencydiagramgenerator["SlnDependencyDiagramGenerator"]
  alloverit_9-4-0["AllOverIt<br>v9.4.0"]
  alloverit-assertion_9-4-0["AllOverIt.Assertion<br>v9.4.0"]
  alloverit-validation_9-4-0["AllOverIt.Validation<br>v9.4.0"]
  fluentvalidation_12-1-1["FluentValidation<br>v12.1.1"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-9["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.9"]
  microsoft-build_17-11-4["Microsoft.Build<br>v17.11.4"]
  microsoft-build-framework_17-11-4["Microsoft.Build.Framework<br>v17.11.4"]
  microsoft-net-stringtools_17-11-4["Microsoft.NET.StringTools<br>v17.11.4"]
  system-configuration-configurationmanager_8-0-0["System.Configuration.ConfigurationManager<br>v8.0.0"]
  system-reflection-metadataloadcontext_8-0-0["System.Reflection.MetadataLoadContext<br>v8.0.0"]
  microsoft-build-locator_1-11-2["Microsoft.Build.Locator<br>v1.11.2"]
  microsoft-extensions-logging-abstractions_10-0-8["Microsoft.Extensions.Logging.Abstractions<br>v10.0.8"]
  system-diagnostics-diagnosticsource_10-0-8["System.Diagnostics.DiagnosticSource<br>v10.0.8"]
  microsoft-sourcelink-github_10-0-300["Microsoft.SourceLink.GitHub<br>v10.0.300"]
  microsoft-build-tasks-git_10-0-300["Microsoft.Build.Tasks.Git<br>v10.0.300"]
  microsoft-sourcelink-common_10-0-300["Microsoft.SourceLink.Common<br>v10.0.300"]
  system-io-hashing_10-0-8["System.IO.Hashing<br>v10.0.8"]
  microsoft-visualstudio-solutionpersistence_1-0-52["Microsoft.VisualStudio.SolutionPersistence<br>v1.0.52"]
  nuget-frameworks_7-6-0["NuGet.Frameworks<br>v7.6.0"]
  nuget-projectmodel_7-6-0["NuGet.ProjectModel<br>v7.6.0"]
  nuget-dependencyresolver-core_7-6-0["NuGet.DependencyResolver.Core<br>v7.6.0"]
  nuget-protocol_7-6-0["NuGet.Protocol<br>v7.6.0"]
  nuget-packaging_7-6-0["NuGet.Packaging<br>v7.6.0"]
  system-reactive_6-1-0["System.Reactive<br>v6.1.0"]
  slndependencydiagramgenerator --> alloverit_9-4-0
  alloverit_9-4-0 --> alloverit-assertion_9-4-0
  slndependencydiagramgenerator --> alloverit-validation_9-4-0
  alloverit-validation_9-4-0 --> alloverit_9-4-0
  alloverit-validation_9-4-0 --> fluentvalidation_12-1-1
  alloverit-validation_9-4-0 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  slndependencydiagramgenerator --> microsoft-build_17-11-4
  microsoft-build_17-11-4 --> microsoft-build-framework_17-11-4
  microsoft-build_17-11-4 --> microsoft-net-stringtools_17-11-4
  microsoft-build_17-11-4 --> system-configuration-configurationmanager_8-0-0
  microsoft-build_17-11-4 --> system-reflection-metadataloadcontext_8-0-0
  slndependencydiagramgenerator --> microsoft-build-locator_1-11-2
  slndependencydiagramgenerator --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  slndependencydiagramgenerator --> microsoft-extensions-logging-abstractions_10-0-8
  microsoft-extensions-logging-abstractions_10-0-8 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  microsoft-extensions-logging-abstractions_10-0-8 --> system-diagnostics-diagnosticsource_10-0-8
  slndependencydiagramgenerator --> microsoft-sourcelink-github_10-0-300
  microsoft-sourcelink-github_10-0-300 --> microsoft-build-tasks-git_10-0-300
  microsoft-sourcelink-github_10-0-300 --> microsoft-sourcelink-common_10-0-300
  microsoft-sourcelink-github_10-0-300 --> system-io-hashing_10-0-8
  slndependencydiagramgenerator --> microsoft-visualstudio-solutionpersistence_1-0-52
  slndependencydiagramgenerator --> nuget-frameworks_7-6-0
  slndependencydiagramgenerator --> nuget-projectmodel_7-6-0
  nuget-projectmodel_7-6-0 --> nuget-dependencyresolver-core_7-6-0
  slndependencydiagramgenerator --> nuget-protocol_7-6-0
  nuget-protocol_7-6-0 --> nuget-packaging_7-6-0
  slndependencydiagramgenerator --> system-reactive_6-1-0
  style alloverit_9-4-0 fill:#ADD8E6,opacity:0.8
  style alloverit-assertion_9-4-0 fill:#FFEC96,opacity:0.8
  style alloverit-validation_9-4-0 fill:#ADD8E6,opacity:0.8
  style fluentvalidation_12-1-1 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-build_17-11-4 fill:#ADD8E6,opacity:0.8
  style microsoft-build-framework_17-11-4 fill:#FFEC96,opacity:0.8
  style microsoft-net-stringtools_17-11-4 fill:#FFEC96,opacity:0.8
  style system-configuration-configurationmanager_8-0-0 fill:#FFEC96,opacity:0.8
  style system-reflection-metadataloadcontext_8-0-0 fill:#FFEC96,opacity:0.8
  style microsoft-build-locator_1-11-2 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-logging-abstractions_10-0-8 fill:#ADD8E6,opacity:0.8
  style system-diagnostics-diagnosticsource_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-sourcelink-github_10-0-300 fill:#ADD8E6,opacity:0.8
  style microsoft-build-tasks-git_10-0-300 fill:#FFEC96,opacity:0.8
  style microsoft-sourcelink-common_10-0-300 fill:#FFEC96,opacity:0.8
  style system-io-hashing_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-visualstudio-solutionpersistence_1-0-52 fill:#ADD8E6,opacity:0.8
  style nuget-frameworks_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-projectmodel_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-dependencyresolver-core_7-6-0 fill:#FFEC96,opacity:0.8
  style nuget-protocol_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-packaging_7-6-0 fill:#FFEC96,opacity:0.8
  style system-reactive_6-1-0 fill:#ADD8E6,opacity:0.8
